In [2]:
# 23-07-25, Wednesday;

# Pandas: Pandas is an open-source software library for the Python programming language, designed for data manipulation and analysis. It provides powerful data structures and tools for working with structured data, particularly tabular data like spreadsheets or SQL tables, and time series data.
# It is collection of Arrays (of NumPy).
# Pandas: Panel Data or Python for Data Analysis.

import pandas as pd

df = pd.read_csv(r"C:\Data Analytics Json\Python\Code\mckinsey.csv")

In [3]:
df

          country  year  population continent  life_exp     gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801  779.445314
1     Afghanistan  1957     9240934      Asia    30.332  820.853030
2     Afghanistan  1962    10267083      Asia    31.997  853.100710
3     Afghanistan  1967    11537966      Asia    34.020  836.197138
4     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298

[1704 rows x 6 columns]

In [4]:
df.head() #pass num for limit of data like in SQL.

       country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106

In [5]:
df.tail() #last data.

       country  year  population continent  life_exp     gdp_cap
1699  Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700  Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701  Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702  Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703  Zimbabwe  2007    12311143    Africa    43.487  469.709298

In [6]:
df.info() # Print a concise summary of a DataFrame.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   country     1704 non-null   object
 1   year        1704 non-null   int64
 2   population  1704 non-null   int64
 3   continent   1704 non-null   object
 4   life_exp    1704 non-null   float64
 5   gdp_cap     1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [7]:
df.describe() # Generate descriptive statistics.

             year    population     life_exp        gdp_cap
count  1704.00000  1.704000e+03  1704.000000    1704.000000
mean   1979.50000  2.960121e+07    59.474439    7215.327081
std      17.26533  1.061579e+08    12.917107    9857.454543
min    1952.00000  6.001100e+04    23.599000     241.165876
25%    1965.75000  2.793664e+06    48.198000    1202.060309
50%    1979.50000  7.023596e+06    60.712500    3531.846988
75%    1993.25000  1.958522e+07    70.845500    9325.462346
max    2007.00000  1.318683e+09    82.603000  113523.132900

In [10]:
df.describe(include = "object") # Generate descriptive statistics for object columns.

            country continent
count          1704      1704
unique          142         5
top     Afghanistan    Africa
freq             12       624

In [12]:
df.shape

(1704, 6)

In [13]:
df.size

10224

In [14]:
len(df)

1704

In [19]:
# creating dataframe.
# List format: Row-wise

df1 =pd.DataFrame([
    ["India", 2025, 142847564, "Asia", 67, 2480],
    ["USA", 2025, 13028475, "North America", 77, 90000],
    ["UAE", 2025, 4000000, "Asia", 75, 73000]
],
columns = ["Country", "Year", "Population", "Continent", "Life Expectancy", "GDP per Capita"])

In [20]:
df1

  Country  Year  Population      Continent  Life Expectancy  GDP per Capita
0   India  2025   142847564           Asia               67            2480
1     USA  2025    13028475  North America               77           90000
2     UAE  2025     4000000           Asia               75           73000

In [21]:
# creating dataframe.
# Dictionary format: Col-wise

df2 = pd.DataFrame({
    "Country" : ["Monaco", "Germany", "Australia"],
    "Year" : [2025, 2025, 2025],
    "Population" : [39000, 7238000, 4532687],
    "Continent" : ["Europe", "Europe", "Australia"],
    "Life Expectancy" : [80, 83, 81],
    "GDP per Capita" : [70000, 80000, 60000]
})

In [22]:
df2

     Country  Year  Population  Continent  Life Expectancy  GDP per Capita
0     Monaco  2025       39000     Europe               80           70000
1    Germany  2025     7238000     Europe               83           80000
2  Australia  2025     4532687  Australia               81           60000

In [23]:
df.head()

       country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106

In [24]:
df["year"] # col names are indices.

0       1952
1       1957
2       1962
3       1967
4       1972
        ...
1699    1987
1700    1992
1701    1997
1702    2002
1703    2007
Name: year, Length: 1704, dtype: int64

In [27]:
type(df["year"]) # series means 1D array.

pandas.core.series.Series

In [29]:
# slicing:
df[["year", "life_exp"]].head() #like SELECT in SQL.

   year  life_exp
0  1952    28.801
1  1957    30.332
2  1962    31.997
3  1967    34.020
4  1972    36.088

In [31]:
df[["country", "year", "population", "gdp_cap", "life_exp", "continent"]].head() #changed sequence.

       country  year  population     gdp_cap  life_exp continent
0  Afghanistan  1952     8425333  779.445314    28.801      Asia
1  Afghanistan  1957     9240934  820.853030    30.332      Asia
2  Afghanistan  1962    10267083  853.100710    31.997      Asia
3  Afghanistan  1967    11537966  836.197138    34.020      Asia
4  Afghanistan  1972    13079460  739.981106    36.088      Asia

In [33]:
df.life_exp.head() #index as method.

0    28.801
1    30.332
2    31.997
3    34.020
4    36.088
Name: life_exp, dtype: float64

In [36]:
df["continent"].unique()

array(['Asia', 'Europe', 'Africa', 'Americas', 'Oceania'], dtype=object)

In [37]:
df["continent"].nunique()

5

In [38]:
df["continent"].value_counts()

continent
Africa      624
Asia        396
Europe      360
Americas    300
Oceania      24
Name: count, dtype: int64

In [40]:
df["country"].unique()

array(['Afghanistan', 'Albania', 'Algeria', 'Angola', 'Argentina',
       'Australia', 'Austria', 'Bahrain', 'Bangladesh', 'Belgium',
       'Benin', 'Bolivia', 'Bosnia and Herzegovina', 'Botswana', 'Brazil',
       'Bulgaria', 'Burkina Faso', 'Burundi', 'Cambodia', 'Cameroon',
       'Canada', 'Central African Republic', 'Chad', 'Chile', 'China',
       'Colombia', 'Comoros', 'Congo, Dem. Rep.', 'Congo, Rep.',
       'Costa Rica', "Cote d'Ivoire", 'Croatia', 'Cuba', 'Czech Republic',
       'Denmark', 'Djibouti', 'Dominican Republic', 'Ecuador', 'Egypt',
       'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Ethiopia',
       'Finland', 'France', 'Gabon', 'Gambia', 'Germany', 'Ghana',
       'Greece', 'Guatemala', 'Guinea', 'Guinea-Bissau', 'Haiti',
       'Honduras', 'Hong Kong, China', 'Hungary', 'Iceland', 'India',
       'Indonesia', 'Iran', 'Iraq', 'Ireland', 'Israel', 'Italy',
       'Jamaica', 'Japan', 'Jordan', 'Kenya', 'Korea, Dem. Rep.',
       'Korea, Rep.', 'Kuwait', 'Lebanon', 'Lesotho', 'Liberia', 'Libya',
       'Madagascar', 'Malawi', 'Malaysia', 'Mali', 'Mauritania',
       'Mauritius', 'Mexico', 'Mongolia', 'Montenegro', 'Morocco',
       'Mozambique', 'Myanmar', 'Namibia', 'Nepal', 'Netherlands',
       'New Zealand', 'Nicaragua', 'Niger', 'Nigeria', 'Norway', 'Oman',
       'Pakistan', 'Panama', 'Paraguay', 'Peru', 'Philippines', 'Poland',
       'Portugal', 'Puerto Rico', 'Reunion', 'Romania', 'Rwanda',
       'Sao Tome and Principe', 'Saudi Arabia', 'Senegal', 'Serbia',
       'Sierra Leone', 'Singapore', 'Slovak Republic', 'Slovenia',
       'Somalia', 'South Africa', 'Spain', 'Sri Lanka', 'Sudan',
       'Swaziland', 'Sweden', 'Switzerland', 'Syria', 'Taiwan',
       'Tanzania', 'Thailand', 'Togo', 'Trinidad and Tobago', 'Tunisia',
       'Turkey', 'Uganda', 'United Kingdom', 'United States', 'Uruguay',
       'Venezuela', 'Vietnam', 'West Bank and Gaza', 'Yemen, Rep.',
       'Zambia', 'Zimbabwe'], dtype=object)

In [41]:
df["country"].nunique()

142